---
kind: type
id: T:Autodesk.Revit.UI.ExternalEventRequest
source: html/f3a47284-4a83-d8f7-8d97-8235de7be1ba.htm
---
# Autodesk.Revit.UI.ExternalEventRequest

Represents the possible outcomes of a request for raising an external event.

## Syntax (C#)
```csharp
public enum ExternalEventRequest
```